In [2]:
### pandas DataFrame
import pandas as pd
grades_dict = {'Wally': [87, 96, 70],
               'Eva': [100, 87, 90],
               'Sam': [94, 77, 90], 
               'Katie': [100, 81, 82],
               'Bob': [83, 65, 85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [3]:
grades.index = ['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [4]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [5]:
grades.iloc[0:2] # select row 1 (0 +1) to row 2

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [6]:
grades.loc[['Test1', 'Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [7]:
grades.iloc[[0, 2]]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [8]:
grades[grades >= 90]

       Wally    Eva   Sam  Katie  Bob
Test1    NaN  100.0  94.0  100.0  NaN
Test2   96.0    NaN   NaN    NaN  NaN
Test3    NaN   90.0  90.0    NaN  NaN

In [9]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [17]:
pd.set_option('precision', 2)

grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [11]:
print(grades.T)

       Test1  Test2  Test3
Wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [12]:
print(grades.sort_index(ascending=False)) # in maniera discendente

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [13]:
print(grades.sort_index(axis=1))

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

In [14]:
print(grades.sort_values(by='Test1', axis=1, ascending=False))

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2   87     81   77     96   65
Test3   90     82   90     70   85

In [15]:
### esercizio pandas
"""
Dato il dictionary:

temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82],
                'Thu': [75, 97], 'Fri': [62, 79]}
                
Svolgere i seguenti task:
a) Converti il dizionario nel DataFrame denominato temperature con 'Low', 'High' come gli indici, 
quindi visualizza il DataFrame.
b) Utilizzare i nomi delle colonne per selezionare solo le colonne da "Mon" a "Wed".
c) Utilizzare l'indice di riga 'Low' per selezionare solo le basse temperature di ogni giorno.
d) Impostare la precisione in virgola mobile su 2 cifre, quindi calcolare la temperatura media per
ogni giorno.
e) Calcolare la media delle temperature, nonch√® il valore low e high.
"""

import pandas as pd
temps = {'Mon': [68, 89], 'Tue': [71, 93], 'Wed': [66, 82],
          'Thu': [75, 97], 'Fri': [62, 79]}

temperatures = pd.DataFrame(temps, index=['Low', 'High'])  # (a)
temperatures.loc[:, 'Mon':'Wed']  # (b)
temperatures.loc['Low']  # (c)
pd.set_option('precision', 2)  # (d)
temperatures.mean()  # (d)
temperatures.mean(axis=1)  # (e)

Low     68.4
High    88.0
dtype: float64